# Exploring the Indian Startup Ecosystem: A Data Driven Analysis of Funding Trends and Industry Sectors

**Project Description**

Your team is trying to venture into the Indian start-up ecosystem. As the data experts of the team, you are to investigate the ecosystem  by analyzing funding received by start-ups from 2018 to 2021 and propose the best course of action.

### **Business Understanding**


The Indian Start-up ecosystem - ranked as the third largest in the world is a network of entrepreneurs, investors and other stakeholders working to build and grow technology-driven startups in the country.

India has seen an astronomical increase in startups and funding with over 16,000 new companies added in 2020 resulting in an unprecedented growth and funding.

Funding is generally provided by investment firms, angel investors, venture capitalists and private equity firms. In the face of market uncertainties, the Indian start-up ecosystem received $8.4 billion in 2023 indicating how resilient the it is.



### **Data understanding and collection**

In [1]:
#Importing all the necessary packages
import pyodbc #just installed with pip
import os
from dotenv import dotenv_values #import the dotenv_values function from the dotenv package
import pandas as pd
import warnings


warnings. filterwarnings('ignore')

In [2]:
# Load environment variables from .env file into a dictionary
environment_variables = dotenv_values('.env')

# Get the values for the credentials you set in the '.env' file
database = environment_variables.get("DB_NAME")

server = environment_variables.get("DB_SERVER")
username = environment_variables.get("SQL_DB_LOGIN")
password = environment_variables.get("DB_PASS")

connection_string = f"DRIVER={{SQL Server}} ; SERVER={server}; DATABASE={database}; UID={username} ; PWD={password}"

In [3]:
# Use the connect method of the pyodbc library and pass in the connection string.

connection = pyodbc.connect( connection_string)

# Now the sql query to get the data is what what you see below.

In [4]:
#Querying the database to retrieve all relevant files from table 1
query1 = "SELECT * FROM dbo.LP1_startup_funding2020"
df_2020 = pd.read_sql(query1, connection)
df_2020.head(2)

,Company_Brand,Founded,HeadQuarter,Sector,What_it_does,Founders,Investor,Amount,Stage,column10
0,Aqgromalin,2019.0,Chennai,AgriTech,Cultivating Ideas for Profit,"Prasanna Manogaran, Bharani C L",Angel investors,200000.0,None,None
1,Krayonnz,2019.0,Bangalore,EdTech,An academy-guardian-scholar centric ecosystem ...,"Saurabh Dixit, Gurudutt Upadhyay",GSF Accelerator,100000.0,Pre-seed,None

In [5]:
#Querying the database to retrieve all relevant files from table 2
query2 = "SELECT * FROM dbo.LP1_startup_funding2021"

df_2021 = pd.read_sql(query2, connection)
df_2021.head(2)

,Company_Brand,Founded,HeadQuarter,Sector,What_it_does,Founders,Investor,Amount,Stage
0,Unbox Robotics,2019.0,Bangalore,AI startup,Unbox Robotics builds on-demand AI-driven ware...,"Pramod Ghadge, Shahid Memon","BEENEXT, Entrepreneur First","$1,200,000",Pre-series A
1,upGrad,2015.0,Mumbai,EdTech,UpGrad is an online higher education platform.,"Mayank Kumar, Phalgun Kompalli, Ravijot Chugh,...","Unilazer Ventures, IIFL Asset Management","$120,000,000",None

In [6]:
# Renaming columns to lowercase with underscores
df_2020= df_2020.rename(columns=lambda x: x.lower().replace(' ', '_'))
df_2020.head(2)

,company_brand,founded,headquarter,sector,what_it_does,founders,investor,amount,stage,column10
0,Aqgromalin,2019.0,Chennai,AgriTech,Cultivating Ideas for Profit,"Prasanna Manogaran, Bharani C L",Angel investors,200000.0,None,None
1,Krayonnz,2019.0,Bangalore,EdTech,An academy-guardian-scholar centric ecosystem ...,"Saurabh Dixit, Gurudutt Upadhyay",GSF Accelerator,100000.0,Pre-seed,None

In [7]:
#performing high level enquiries on the data
df_2020.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1055 entries, 0 to 1054
Data columns (total 10 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   company_brand  1055 non-null   object
 1   founded        842 non-null    float64
 2   headquarter    961 non-null    object
 3   sector         1042 non-null   object
 4   what_it_does   1055 non-null   object
 5   founders       1043 non-null   object
 6   investor       1017 non-null   object
 7   amount         801 non-null    float64
 8   stage          591 non-null    object
 9   column10       2 non-null      object
dtypes: float64(2), object(8)
memory usage: 82.6+ KB

From the observations, there are strings and numbers in the dataset. There are 10 columns in the 2020_dataset with nulls in almost all of them.

In [8]:
# Rename columns to lowercase with underscores
df_2021= df_2021.rename(columns=lambda x: x.lower().replace(' ', '_'))
df_2021.head(2)

,company_brand,founded,headquarter,sector,what_it_does,founders,investor,amount,stage
0,Unbox Robotics,2019.0,Bangalore,AI startup,Unbox Robotics builds on-demand AI-driven ware...,"Pramod Ghadge, Shahid Memon","BEENEXT, Entrepreneur First","$1,200,000",Pre-series A
1,upGrad,2015.0,Mumbai,EdTech,UpGrad is an online higher education platform.,"Mayank Kumar, Phalgun Kompalli, Ravijot Chugh,...","Unilazer Ventures, IIFL Asset Management","$120,000,000",None

In [9]:
#performing high level enquiries on the second dataset
df_2021.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1209 entries, 0 to 1208
Data columns (total 9 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   company_brand  1209 non-null   object
 1   founded        1208 non-null   float64
 2   headquarter    1208 non-null   object
 3   sector         1209 non-null   object
 4   what_it_does   1209 non-null   object
 5   founders       1205 non-null   object
 6   investor       1147 non-null   object
 7   amount         1206 non-null   object
 8   stage          781 non-null    object
dtypes: float64(1), object(8)
memory usage: 85.1+ KB

In [10]:
#checking for any unique values and inconsistencies in amount column
print(df_2021.amount.unique().tolist())

['$1,200,000', '$120,000,000', '$30,000,000', '$51,000,000', '$2,000,000', '$188,000,000', '$200,000', 'Undisclosed', '$1,000,000', '$3,000,000', '$100,000', '$700,000', '$9,000,000', '$40,000,000', '$49,000,000', '$400,000', '$300,000', '$25,000,000', '$160,000,000', '$150,000', '$1,800,000', '$5,000,000', '$850,000', '$53,000,000', '$500,000', '$1,100,000', '$6,000,000', '$800,000', '$10,000,000', '$21,000,000', '$7,500,000', '$26,000,000', '$7,400,000', '$1,500,000', '$600,000', '$800,000,000', '$17,000,000', '$3,500,000', '$15,000,000', '$215,000,000', '$2,500,000', '$350,000,000', '$5,500,000', '$83,000,000', '$110,000,000', '$500,000,000', '$65,000,000', '$150,000,000,000', '$300,000,000', '$2,200,000', '$35,000,000', '$140,000,000', '$4,000,000', '$13,000,000', None, '$Undisclosed', '$2000000', '$800000', '$6000000', '$2500000', '$9500000', '$13000000', '$5000000', '$8000000', '$1000000', 'Upsparks', '$200000', '$12000000', '$1500000', '$1700000', '$5500000', '$400000', '$150000000', '$4000000', '$100000000', '$500000', '$15000000', '$10000000', '$40000000', '$225000000', '$6700000', '$1300000', '$20000000', '$250000', '$21000000', '$1200000', '$52000000', '$3800000', '$17500000', '$42000000', '$2300000', '$7000000', '$30000000', '$450000000', '$28000000', '$300000', '$3500000', '$8500000', '$25000000', '$3000000', '$37000000', '$370000000', '$700000', '$16000000', '$100000', '$44000000', '$770000', '$125000000', '$35000000', '$50000000', '$4900000', '$145000000', '$22000000', '$70000000', '$6600000', '$32000000', '$24000000', '$725000', '$461000', 'Series C', 'Seed', '$96000000', '$60000000', '$500000000', '$266000000', '$4500000', '$325000000', '$6500000', '$1600000', '$150000', '$225000', '$85000000', '$235000', '$260000', '$2900000', '$53000000', '$1100000', '$86000000', '$130000', '$$100,00', '$111000000', '$265000', '$76000000', '$100,000,000', '$75,000,000', '$3,800,000', '$12,000,000', '$1,600,000', '$260,000', '$1,000,000,000', '$18,000,000', '$20,000,000', '$350,000', '$95,000,000', '$4,100,000', '$5,200,000', '$8,000,000', '$1,400,000', '$2,600,000', '$900,000', '$250,000', '$16,000,000', '$7,000,000', '$11,000,000', '$280,000,000', '$50,000,000', '$14,300,000', '$81,000,000', '$1,300,000', '$8,200,000', '$70,000,000', '$720,000', '$600000', '$9000000', '$1800000', '$330000', '$undisclosed', '$200000000', '$36000000', '$67000000', '$10200000', '$220000000', '$108000000', '$75000000', '$450000', '$660000000', 'ah! Ventures', '$45000000', '$3200000', '$370000', 'Pre-series A', 'ITO Angel Network, LetsVenture', '$48000000', '$3600000', '$11000000', '$192000000', '$65000000', '$1400000', '$1900000', '$41000000', '$144000000', '$5200000', '$270000000', '$140000', '$250000000', '$320000', '$350000000', '$4800000', '$38000000', '$125000', '$26000000', '$64000000', '$620000', '$900000', 'JITO Angel Network, LetsVenture', '$2600000', '$1,250,000', '$400,000,000', '$1,700,000', '$27,000,000', '$234,000,000', '$460,000,000', '$13,500,000', '$5,100,000', '$195,000,000', '$125,000', '$45,000,000', '$200,000,000', '$7,300,000', '$6,300,000', '$12,500,000', '$24,000,000', '$140,000', '$16,500,000', '$340,000', '$43,000,000', '$150,000,000', '$3300000', '$92000000', '$17000000', '$135000000', '$$1,55,000', '$2100000', '$840000000', '$248000000', '$4300000', '$570000', '$2200000', '$4700000', '$300000000', '$260000000', '$140000000', '$175000000', '$19000000', '$810000', '$7500000', '$600000000', '$90000000', '$5700000', '$6750000', '$78000000', '$5400000', '$115000000', '$255000000', '$18000000', '$570000000', '$550000', '$2700000', '$4200000', '$31000000', '$540000', '$14000000', '$340000', '$', '$6200000', '$750000', '$6300000', '$23000000', '$55000000']

In [11]:
df_2021.describe(include="all").T

,count,unique,top,freq,mean,std,min,25%,50%,75%,max
company_brand,1209,1033,BharatPe,8,NaN,NaN,NaN,NaN,NaN,NaN,NaN
founded,1208.0,NaN,NaN,NaN,2016.655629,4.517364,1963.0,2015.0,2018.0,2020.0,2021.0
headquarter,1208,70,Bangalore,426,NaN,NaN,NaN,NaN,NaN,NaN,NaN
sector,1209,254,FinTech,122,NaN,NaN,NaN,NaN,NaN,NaN,NaN
what_it_does,1209,1143,BharatPe develops a QR code-based payment app ...,4,NaN,NaN,NaN,NaN,NaN,NaN,NaN
founders,1205,1095,"Ashneer Grover, Shashvat Nakrani",7,NaN,NaN,NaN,NaN,NaN,NaN,NaN
investor,1147,937,Inflection Point Ventures,24,NaN,NaN,NaN,NaN,NaN,NaN,NaN
amount,1206,278,$Undisclosed,73,NaN,NaN,NaN,NaN,NaN,NaN,NaN
stage,781,31,Seed,246,NaN,NaN,NaN,NaN,NaN,NaN,NaN

From the observations, there are strings and numbers in the dataset. There are 9 columns in the 2021_dataset with nulls in almost all of them.

In [12]:
#reading third dataset from csv file into a pandas dataframe
df_2019 = pd.read_csv("startup_funding2019.csv")

# Rename columns to lowercase with underscores
df_2019= df_2019.rename(columns=lambda x: x.lower().replace(' ', '_'))
df_2019.head(2)

,company/brand,founded,headquarter,sector,what_it_does,founders,investor,amount($),stage
0,Bombay Shaving,NaN,NaN,Ecommerce,Provides a range of male grooming products,Shantanu Deshpande,Sixth Sense Ventures,"$6,300,000",NaN
1,Ruangguru,2014.0,Mumbai,Edtech,A learning platform that provides topic-based ...,"Adamas Belva Syah Devara, Iman Usman.",General Atlantic,"$150,000,000",Series C

In [13]:
#removing symbols from columns to make later concatenation uniform
df_2019 = df_2019.rename(columns={"company/brand":"company_brand", "amount($)":"amount"})

In [14]:
#requesting info of 2019 dataset
df_2019.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 89 entries, 0 to 88
Data columns (total 9 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   company_brand  89 non-null     object
 1   founded        60 non-null     float64
 2   headquarter    70 non-null     object
 3   sector         84 non-null     object
 4   what_it_does   89 non-null     object
 5   founders       86 non-null     object
 6   investor       89 non-null     object
 7   amount         89 non-null     object
 8   stage          43 non-null     object
dtypes: float64(1), object(8)
memory usage: 6.4+ KB

In [15]:
#checking for any unique values and inconsistencies in amount column
print(df_2021.amount.unique().tolist())

['$1,200,000', '$120,000,000', '$30,000,000', '$51,000,000', '$2,000,000', '$188,000,000', '$200,000', 'Undisclosed', '$1,000,000', '$3,000,000', '$100,000', '$700,000', '$9,000,000', '$40,000,000', '$49,000,000', '$400,000', '$300,000', '$25,000,000', '$160,000,000', '$150,000', '$1,800,000', '$5,000,000', '$850,000', '$53,000,000', '$500,000', '$1,100,000', '$6,000,000', '$800,000', '$10,000,000', '$21,000,000', '$7,500,000', '$26,000,000', '$7,400,000', '$1,500,000', '$600,000', '$800,000,000', '$17,000,000', '$3,500,000', '$15,000,000', '$215,000,000', '$2,500,000', '$350,000,000', '$5,500,000', '$83,000,000', '$110,000,000', '$500,000,000', '$65,000,000', '$150,000,000,000', '$300,000,000', '$2,200,000', '$35,000,000', '$140,000,000', '$4,000,000', '$13,000,000', None, '$Undisclosed', '$2000000', '$800000', '$6000000', '$2500000', '$9500000', '$13000000', '$5000000', '$8000000', '$1000000', 'Upsparks', '$200000', '$12000000', '$1500000', '$1700000', '$5500000', '$400000', '$150000000', '$4000000', '$100000000', '$500000', '$15000000', '$10000000', '$40000000', '$225000000', '$6700000', '$1300000', '$20000000', '$250000', '$21000000', '$1200000', '$52000000', '$3800000', '$17500000', '$42000000', '$2300000', '$7000000', '$30000000', '$450000000', '$28000000', '$300000', '$3500000', '$8500000', '$25000000', '$3000000', '$37000000', '$370000000', '$700000', '$16000000', '$100000', '$44000000', '$770000', '$125000000', '$35000000', '$50000000', '$4900000', '$145000000', '$22000000', '$70000000', '$6600000', '$32000000', '$24000000', '$725000', '$461000', 'Series C', 'Seed', '$96000000', '$60000000', '$500000000', '$266000000', '$4500000', '$325000000', '$6500000', '$1600000', '$150000', '$225000', '$85000000', '$235000', '$260000', '$2900000', '$53000000', '$1100000', '$86000000', '$130000', '$$100,00', '$111000000', '$265000', '$76000000', '$100,000,000', '$75,000,000', '$3,800,000', '$12,000,000', '$1,600,000', '$260,000', '$1,000,000,000', '$18,000,000', '$20,000,000', '$350,000', '$95,000,000', '$4,100,000', '$5,200,000', '$8,000,000', '$1,400,000', '$2,600,000', '$900,000', '$250,000', '$16,000,000', '$7,000,000', '$11,000,000', '$280,000,000', '$50,000,000', '$14,300,000', '$81,000,000', '$1,300,000', '$8,200,000', '$70,000,000', '$720,000', '$600000', '$9000000', '$1800000', '$330000', '$undisclosed', '$200000000', '$36000000', '$67000000', '$10200000', '$220000000', '$108000000', '$75000000', '$450000', '$660000000', 'ah! Ventures', '$45000000', '$3200000', '$370000', 'Pre-series A', 'ITO Angel Network, LetsVenture', '$48000000', '$3600000', '$11000000', '$192000000', '$65000000', '$1400000', '$1900000', '$41000000', '$144000000', '$5200000', '$270000000', '$140000', '$250000000', '$320000', '$350000000', '$4800000', '$38000000', '$125000', '$26000000', '$64000000', '$620000', '$900000', 'JITO Angel Network, LetsVenture', '$2600000', '$1,250,000', '$400,000,000', '$1,700,000', '$27,000,000', '$234,000,000', '$460,000,000', '$13,500,000', '$5,100,000', '$195,000,000', '$125,000', '$45,000,000', '$200,000,000', '$7,300,000', '$6,300,000', '$12,500,000', '$24,000,000', '$140,000', '$16,500,000', '$340,000', '$43,000,000', '$150,000,000', '$3300000', '$92000000', '$17000000', '$135000000', '$$1,55,000', '$2100000', '$840000000', '$248000000', '$4300000', '$570000', '$2200000', '$4700000', '$300000000', '$260000000', '$140000000', '$175000000', '$19000000', '$810000', '$7500000', '$600000000', '$90000000', '$5700000', '$6750000', '$78000000', '$5400000', '$115000000', '$255000000', '$18000000', '$570000000', '$550000', '$2700000', '$4200000', '$31000000', '$540000', '$14000000', '$340000', '$', '$6200000', '$750000', '$6300000', '$23000000', '$55000000']

In [16]:
df_2019.describe(include="all").T

,count,unique,top,freq,mean,std,min,25%,50%,75%,max
company_brand,89,87,Kratikal,2,NaN,NaN,NaN,NaN,NaN,NaN,NaN
founded,60.0,NaN,NaN,NaN,2014.533333,2.937003,2004.0,2013.0,2015.0,2016.25,2019.0
headquarter,70,17,Bangalore,21,NaN,NaN,NaN,NaN,NaN,NaN,NaN
sector,84,52,Edtech,7,NaN,NaN,NaN,NaN,NaN,NaN,NaN
what_it_does,89,88,Online meat shop,2,NaN,NaN,NaN,NaN,NaN,NaN,NaN
founders,86,85,"Vivek Gupta, Abhay Hanjura",2,NaN,NaN,NaN,NaN,NaN,NaN,NaN
investor,89,86,Undisclosed,3,NaN,NaN,NaN,NaN,NaN,NaN,NaN
amount,89,50,Undisclosed,12,NaN,NaN,NaN,NaN,NaN,NaN,NaN
stage,43,15,Series A,10,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [18]:
#reading third dataset from csv file into a pandas dataframe
df_2018 = pd.read_csv("startup_funding2018.csv")
df_2018= df_2018.rename(columns=lambda x: x.lower().replace(' ', '_'))
df_2018.head()

,company_name,industry,round/series,amount,location,about_company
0,TheCollegeFever,"Brand Marketing, Event Promotion, Marketing, S...",Seed,250000,"Bangalore, Karnataka, India","TheCollegeFever is a hub for fun, fiesta and f..."
1,Happy Cow Dairy,"Agriculture, Farming",Seed,"₹40,000,000","Mumbai, Maharashtra, India",A startup which aggregates milk from dairy far...
2,MyLoanCare,"Credit, Financial Services, Lending, Marketplace",Series A,"₹65,000,000","Gurgaon, Haryana, India",Leading Online Loans Marketplace in India
3,PayMe India,"Financial Services, FinTech",Angel,2000000,"Noida, Uttar Pradesh, India",PayMe India is an innovative FinTech organizat...
4,Eunimart,"E-Commerce Platforms, Retail, SaaS",Seed,—,"Hyderabad, Andhra Pradesh, India",Eunimart is a one stop solution for merchants ...

In [19]:
#checking for any unique values and inconsistencies in amount column
print(df_2018.amount.unique().tolist())

['250000', '₹40,000,000', '₹65,000,000', '2000000', '—', '1600000', '₹16,000,000', '₹50,000,000', '₹100,000,000', '150000', '1100000', '₹500,000', '6000000', '650000', '₹35,000,000', '₹64,000,000', '₹20,000,000', '1000000', '5000000', '4000000', '₹30,000,000', '2800000', '1700000', '1300000', '₹5,000,000', '₹12,500,000', '₹15,000,000', '500000', '₹104,000,000', '₹45,000,000', '13400000', '₹25,000,000', '₹26,400,000', '₹8,000,000', '₹60,000', '9000000', '100000', '20000', '120000', '₹34,000,000', '₹342,000,000', '$143,145', '₹600,000,000', '$742,000,000', '₹1,000,000,000', '₹2,000,000,000', '$3,980,000', '$10,000', '₹100,000', '₹250,000,000', '$1,000,000,000', '$7,000,000', '$35,000,000', '₹550,000,000', '$28,500,000', '$2,000,000', '₹240,000,000', '₹120,000,000', '$2,400,000', '$30,000,000', '₹2,500,000,000', '$23,000,000', '$150,000', '$11,000,000', '₹44,000,000', '$3,240,000', '₹60,000,000', '$540,000,000', '₹650,000,000', '₹1,600,000,000', '$900,000', '$10,000,000', '$1,500,000', '₹70,000,000', '$1,000,000', '$5,000,000', '$14,000,000', '₹102,500,000', '$100,000,000', '₹1,200,000', '₹5,200,000,000', '$800,000', '$1,041,000', '$100,000', '$15,000', '1400000', '1200000', '2200000', '1800000', '3600000', '₹9,500,000', '300000', '6830000', '200000', '₹150,000,000', '4300000', '364846', '400000', '1500000', '₹7,000,000', '₹1,400,000', '₹10,000,000', '₹22,500,000', '13200000', '50000', '₹140,200,000', '3000000', '1250000', '180000', '₹19,200,000', '₹103,000,000', '4200000', '175000', '1450000', '₹200,000', '4500000', '600000', '₹16,600,000', '₹12,000,000', '15000000', '₹33,000,000', '125000', '130000', '₹34,900,000', '₹72,000,000', '17200000', '₹32,000,000', '3500000', '₹135,000,000', '12000000', '$40,000,000', '$1,100,000', '$50,000,000', '₹1,540,000,000', '$3,000,000', '$6,000,000', '₹140,000,000', '$41,900,000', '₹1,410,000,000', '$3,530,000', '$200,000', '$3,300,000', '₹580,000,000', '₹36,000,000', '₹340,000,000', '$210,000,000', '$37,680,000', '$250,000', '$20,000', '₹510,000,000', '₹2,200,000,000', '22000000', '70000', '10000000', '₹15,392,000,000', '₹20,000,000,000', '₹4,000,000,000', '185000000', '65000000', '₹165,000,000', '700000', '30000000', '₹210,000,000', '210000000', '₹2,029,600,000', '75000000', '₹80,000,000', '1760000', '2700000', '₹280,000,000', '₹800,000,000', '750000', '2500000', '80000000', '25000000', '₹730,000,000', '₹400,000,000', '3700000', '5600000', '₹260,000,000', '99230000', '70000000', '40000', '550000', '50000000', '365000000', '₹8,750,000', '₹78,000,000', '28000000', '₹264,000,000', '100000000', '₹1,130,000,000', '₹810,000,000', '₹1,400,000,000', '14900000', '225000000', '7500', '35000000']

In [20]:
df_2018 = df_2018.rename(columns={"company_name":"company_brand", 
                                   "industry":"sector",
                                   "round/series":"stage",
                                   "location":"headquarter",
                                   "about_company":"what_it_does"})

In [21]:
df_2018.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 526 entries, 0 to 525
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   company_brand  526 non-null    object
 1   sector         526 non-null    object
 2   stage          526 non-null    object
 3   amount         526 non-null    object
 4   headquarter    526 non-null    object
 5   what_it_does   526 non-null    object
dtypes: object(6)
memory usage: 24.8+ KB

In [22]:
df_2018.describe().T

,count,unique,top,freq
company_brand,526,525,TheCollegeFever,2
sector,526,405,—,30
stage,526,21,Seed,280
amount,526,198,—,148
headquarter,526,50,"Bangalore, Karnataka, India",102
what_it_does,526,524,"TheCollegeFever is a hub for fun, fiesta and f...",2

In [23]:
#concatenating three datasets into a single dataframe
df = pd.concat([df_2018, df_2019,df_2020,df_2021],ignore_index=True)
df.head()
#saving the df file to a csv file for further cleaning and preparation
df.to_csv("startup_2018_19_20_21.csv")

In [24]:
#checking the 2018 array
df_2018.shape

(526, 6)

In [25]:
#checking shape of 2019 dataframe
df_2019.shape

(89, 9)

In [26]:
#checking shape of 2020 dataframe
df_2020.shape

(1055, 10)

In [27]:
#checking shape of 2021 dataframe
df_2021.shape

(1209, 9)

### Asumptions
- All amounts will be converted to USD in the Data Cleaning and EDA
 - 2018 amount column will assume the currency of USD
- Rename of df_2018 columns based on similarities in wording and comparison with other years

 ### Observations
- Column 10 has no real signinficant data and will be dropped in data cleaning
- Some rows have wrong information pertaining to the columns and will have to be discussed further
- Nulls in the dataset will also have to be discussed and dealt with

## Hypothesis testing

Null hypothesis: The sector of a start up does not have an impact on the amount of funding.

Alternative hypothesis testing: The sector of a start up does have an impact on the amount of funding.

# Analytical questions

- Which sector has received the most funding over the time frame?

- The distribution of start ups in stages and the amount allocated each

- In which 3 locations have start ups had the most funding?

- Which year had the most investors?

- Who are the top 10 investor in the Indian start ups?

- What was the impact of Covid-19 pandemic on start-up funding in 2020 as compare to the other years?

- How is funding related to metropolitan cities and small towns? (For recommendation on government policies)